name: "python_donut_question_answering"
backend: "python"
max_batch_size: 1

input [
  {
    name: "pixel_values"
    data_type: TYPE_FP16
    dims: [-1, -1, -1]
  },
  {
    name: "question"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP16
    dims: [-1, -1]
  }
]